app/controllers/calculations_controller.rb

SELECT "calculations".* FROM "calculations"
---
  def index
    @calculations = Calculation.all

INSERT INTO "calculations" ("calculation_type", "start_value", "end_value", "solution", "error", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    calculation_params.delete("controller")
    calculation_params.delete("action")
    @calculation = Calculation.create(calculation_params)

SELECT "calculations".* FROM "calculations" WHERE "calculations"."id" = $1 LIMIT $2  [["id", 182], ["LIMIT", 1]]
---
  def show
    @calculation = Calculation.find(params[:id])

SELECT "calculations".* FROM "calculations" WHERE "calculations"."id" = $1 LIMIT $2  [["id", 211], ["LIMIT", 1]]
DELETE FROM "calculations" WHERE "calculations"."id" = $1  [["id", 211]]
---
  def destroy
    @calculation = Calculation.find(params[:id])
    @calculation.destroy